#+TITLE: anneKsiy's  Amazon emacs org config
#+AUTHOR: Abdullah "anneKsiy" Adam

** Viewing reviewing CRs
#+begin_src emacs-lisp
;(defun husain--mu4e-show-cr-patch (msg)
  ;(let* ((path (mu4e-message-field msg :path))
         ;(patches)
         ;(buf))
    ;(message "Loading patches...")
    ;(setq patches (split-string
                   ;(shell-command-to-string
                    ;(format "~/bin/cr-get-patch %s" path)) "\n" t))
    ;(dolist (p patches)
      ;(find-file p)
      ;(delete-other-windows)
      ;(setq buf (get-buffer-create (file-name-nondirectory p)))
      ;(with-current-buffer buf
        ;(read-only-mode 1)))))

;(use-package diffview)

;; add this in mu4e config
;(add-to-list 'mu4e-view-actions
         ;'("CR patch view" . husain--mu4e-show-cr-patch) t)
#+end_src

#+RESULTS:
: ((capture message . mu4e-action-capture-message) (view in browser . mu4e-action-view-in-browser) (xview in xwidget . mu4e-action-view-in-xwidget) (show this thread . mu4e-action-show-thread) (CR patch view . husain--mu4e-show-cr-patch))

#+begin_src emacs-lisp
;; (setq test "Uploading EC2APITLALambda...

;;  * 21345678 - Some stuff
;;  * 21345679 - Some more stuff

;; Uploading TestPackage...

;;  * 2685d84 - warning
;;  * 2685d84 - logs

;; Created code review of EC2APIThrottlingCore, EC2ThrottlingCLI...

;; https://code.amazon.com/reviews/CR-99168529")

;; (setq cr--separator "Process cr finished")
;; (setq cr--buffer-name "*cr*")

;; (setq cr--package-name-identifier "Uploading")
;; (setq cr--crux-link-identifier "https://code.amazon.com/reviews")

;; (setq cr (start-process "cr" cr--buffer-name "echo" test))
;; (process-status cr)

;; (cl-defstruct code-review
;;   crux-id
;;   crux-link
;;   packages-with-commits)

;; (code-review-crux-link (make-code-review :crux-link "blah" :packages-with-commits '(())))



;; (setq stuff (with-current-buffer cr--buffer-name
;;               (set-buffer cr--buffer-name)
;;               (beginning-of-buffer)
;;               (let ((code-reviews)
;;                     (cr-block-point t)
;;                     (next-cr-block-point 1)
;;                     (next-package-point 0)
;;                     (crux-link)
;;                     (package-name)
;;                     (package-commits))
;;                 (while cr-block-point
;;                   (setq package-commits nil)
;;                   (setq next-cr-block-point
;;                         (or
;;                          (save-excursion
;;                            (goto-char next-package-point)
;;                            (search-forward cr--separator nil t))
;;                          (- next-package-point 1)))
;;                   (setq cr-block-point (save-excursion
;;                                          (goto-char next-cr-block-point)
;;                                          (search-forward cr--separator nil t)))
;;                   (while (> next-cr-block-point (setq next-package-point
;;                                                       (or
;;                                                        (save-excursion
;;                                                          (goto-char next-package-point)
;;                                                          (search-forward cr--package-name-identifier nil t))
;;                                                        (point-max))))
;;                     (message "package-%s < block-%s" next-package-point next-cr-block-point)
;;                     (when (not (= next-package-point (point-max)))
;;                       (setq crux-link (get-crux-link next-package-point next-cr-block-point)
;;                             package-name (get-package-name next-package-point))
;;                       (add-to-list 'package-commits (cons package-name (get-package-commits next-package-point)))))
;;                   (message "CR-BLOCK: %s" cr-block-point)
;;                   (push (make-code-review :crux-link crux-link :crux-id (get-crux-id crux-link) :packages-with-commits (cons package-name package-commits))
;;                         code-reviews))
;;                 code-reviews)))


;; (length stuff)
;; (nth 1 stuff)
;; (dolist (it stuff)
;;   (dolist (in (cdr (code-review-packages-with-commits it)))
;;     (print (car in))))


;; (defun get-crux-link (package-point cr-block-point)
;;   (let ((final-package-in-cr-block package-point)
;;         (next-package package-point))
;;     (while (> cr-block-point (or (setq next-package (save-excursion
;;                                                       (goto-char next-package)
;;                                                       (search-forward cr--package-name-identifier nil t)))
;;                                  (+ 1 cr-block-point)))
;;       (setq final-package-in-cr-block next-package))
;;     (save-excursion
;;       (goto-char final-package-in-cr-block)
;;       (search-forward cr--crux-link-identifier nil t)
;;       (string-trim (thing-at-point 'line)))))

;; (defun get-crux-id (crux-link)
;;   (substring crux-link (cl-search "CR" crux-link)))

;; (defun get-package-name (package-point)
;;   (let ((package-sentence (save-excursion
;;                             (goto-char package-point)
;;                             (string-trim (thing-at-point 'line)))))
;;     (substring package-sentence (+ 1 (cl-search " " package-sentence)) (cl-search "." package-sentence))))

;; (defun get-package-commits (package-point)
;;   (let ((next-package-point (or (save-excursion
;;                                   (goto-char package-point)
;;                                   (search-forward cr--package-name-identifier nil t))
;;                                 0))
;;         (next-commit-point package-point)
;;         (package-commits '()))
;;     (while (and (< 0 (setq next-commit-point
;;                            (or
;;                             (save-excursion
;;                               (goto-char next-commit-point)
;;                               (search-forward "* " nil t))
;;                             -1)))
;;                 (> next-package-point next-commit-point))
;;       (push (save-excursion
;;               (goto-char next-commit-point)
;;               (string-trim (thing-at-point 'line)))
;;             package-commits))
;;     package-commits))

;; (setq thing "Uploading EC2APIThrottlingCore...")
;; (substring thing (+ 1 (cl-search " " thing)) (cl-search "." thing))
#+end_src

